import cv2
import numpy as np
img = np.zeros((480,640,3),np.uint8)
#画线
# cv2.line(img,(10,20),(300,400),(255,0,0),4,4)
# cv2.line(img,(50,100),(300,400),(255,0,0),6,8)
# cv2.line(img,(100,200),(300,400),(255,0,0),10,16)

#画矩形,左上角顶点的坐标,右下角顶点的坐标,正值，表示矩形边框的厚度；负值（如 -1），填充矩形
# cv2.rectangle(img,(10,10),(100,100),(0,0,255),-1)

#画圆,圆心的坐标,圆的半径,边框厚度默认为1,-1为填充圆
# cv2.circle(img,(320,240),100,(0,0,255))
# cv2.circle(img,(320,240),5,(0,255,0),-1)

#画椭圆,中心坐标,（长轴，短轴）一半,旋转角度,开始角度,结束角度,颜色,填充参数
# cv2.ellipse(img,(320,240),(100,60),0,0,180,(123,163,241),-1)

#画多边形,创建点集
# pts = np.array([[300, 100], [450, 200], [150, 200],[300,300]], np.int32)
#画多边形,img,[点集],是否闭环,颜色
# cv2.polylines(img, [pts], True, (0, 0, 255))
# #填充多边形,img,点集,颜色
# cv2.fillPoly(img,[pts],(255,0,0))

#画文本,img,字符串,起始点(x,y),字体,字号,颜色
# cv2.putText(img,'CDR',(100,100),16,2,(0,255,0))

cv2.imshow('draw',img)
key = cv2.waitKey(0)
if key & 0xFF == ord('q'):
    cv2.destroyAllWindows()